//==========================================
//
//  チェックポイント(checkpoint.cpp)
//  Author : Tomoya Kanazaki
//
//==========================================
#include "checkpoint.h"

//==========================================
//  コンストラクタ
//==========================================
CCheckPoint::CCheckPoint():
	m_bSave(false)
{
}

//==========================================
//  デストラクタ
//==========================================
CCheckPoint::~CCheckPoint()
{
}

//==========================================
//  初期化処理
//==========================================
HRESULT CCheckPoint::Init(void)
{
	return E_NOTIMPL;
}

//==========================================
//  終了処理
//==========================================
void CCheckPoint::Uninit(void)
{
}

//==========================================
//  更新処理
//==========================================
void CCheckPoint::Update(const float fDeltaTime)
{
}

//==========================================
//  描画処理
//==========================================
void CCheckPoint::Draw(CShader* pShader)
{
}

//==========================================
//  生成処理
//==========================================
CCheckPoint* CCheckPoint::Create(const D3DXVECTOR3& rPos, const D3DXVECTOR3& rRot)
{
	return nullptr;
}

//==========================================
//  プレイヤーとの当たり判定
//==========================================
void CCheckPoint::CollisionPlayer(void)
{

}
