//============================================================
//
//	エフェクシアマネージャー処理 [effekseerManager.cpp]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	インクルードファイル
//************************************************************
#include "effekseerManager.h"
#include "effekseerControl.h"

//************************************************************
//	定数宣言
//************************************************************
namespace
{
	const CObject::ELabel	LABEL		= CObject::LABEL_NONE;	// エフェクシアマネージャーのラベル
	const CObject::EDim		DIM			= CObject::DIM_3D;		// エフェクシアマネージャーの次元
	const int				PRIORITY	= 7;					// エフェクシアマネージャーの優先順位
}

//************************************************************
//	子クラス [CEffekseerManager] のメンバ関数
//************************************************************
//============================================================
//	コンストラクタ
//============================================================
CEffekseerManager::CEffekseerManager() : CObject(LABEL, DIM, PRIORITY)
{

}

//============================================================
//	デストラクタ
//============================================================
CEffekseerManager::~CEffekseerManager()
{

}

//============================================================
//	初期化処理
//============================================================
HRESULT CEffekseerManager::Init(void)
{
	// エフェクシアの初期化
	GET_EFFECT->Init();

	// 成功を返す
	return S_OK;
}

//============================================================
//	終了処理
//============================================================
void CEffekseerManager::Uninit(void)
{
	// エフェクシアの終了
	GET_EFFECT->Uninit();

	// オブジェクトを破棄
	Release();
}

//============================================================
//	更新処理
//============================================================
void CEffekseerManager::Update(const float fDeltaTime)
{
	// エフェクシアの更新
	GET_EFFECT->Update();
}

//============================================================
//	描画処理
//============================================================
void CEffekseerManager::Draw(CShader * /*pShader*/)
{
	// エフェクシアの描画
	GET_EFFECT->Draw();
}

//============================================================
//	生成処理
//============================================================
CEffekseerManager *CEffekseerManager::Create(void)
{
	// エフェクシアマネージャーの生成
	CEffekseerManager *pEffekseerManager = new CEffekseerManager;
	if (pEffekseerManager == nullptr)
	{ // 生成に失敗した場合

		return nullptr;
	}
	else
	{ // 生成に成功した場合

		// エフェクシアマネージャーの初期化
		if (FAILED(pEffekseerManager->Init()))
		{ // 初期化に失敗した場合

			// エフェクシアマネージャーの破棄
			SAFE_DELETE(pEffekseerManager);
			return nullptr;
		}

		// 確保したアドレスを返す
		return pEffekseerManager;
	}
}
