//============================================================
//
//	警告敵処理 [enemy_Caveat.cpp]
//	Author：小原立暉
//
//============================================================
//************************************************************
//	インクルードファイル
//************************************************************
#include "manager.h"
#include "enemyCaveat.h"
#include "renderer.h"
#include "deltaTime.h"

#include "player.h"
#include "player_clone.h"

//************************************************************
//	定数宣言
//************************************************************
namespace
{
	const char* SETUP_TXT = "data\\CHARACTER\\player.txt";	// セットアップテキスト相対パス
	const float MOVE = -300.0f;								// 移動量
	const float ROT_REV = 0.5f;								// 向きの補正係数
}

//************************************************************
//	子クラス [CEnemyCaveat] のメンバ関数
//************************************************************
//============================================================
//	コンストラクタ
//============================================================
CEnemyCaveat::CEnemyCaveat() : CEnemy(),
m_state(STATE_CRAWL)		// 状態
{

}

//============================================================
//	デストラクタ
//============================================================
CEnemyCaveat::~CEnemyCaveat()
{

}

//============================================================
//	初期化処理
//============================================================
HRESULT CEnemyCaveat::Init(void)
{
	// 敵の初期化
	if (FAILED(CEnemy::Init()))
	{ // 初期化に失敗した場合

		// 失敗を返す
		assert(false);
		return E_FAIL;
	}

	// キャラクター情報の割当
	BindCharaData(SETUP_TXT);

	// マテリアルの設定処理
	SetAllMaterial(material::DamageRed());

	// 成功を返す
	return S_OK;
}

//============================================================
//	終了処理
//============================================================
void CEnemyCaveat::Uninit(void)
{
	// 敵の終了
	CEnemy::Uninit();
}

//============================================================
//	更新処理
//============================================================
void CEnemyCaveat::Update(const float fDeltaTime)
{
	// 過去位置更新
	UpdateOldPosition();

	// 状態処理
	State();

	// 敵の更新
	CEnemy::Update(fDeltaTime);
}

//============================================================
//	描画処理
//============================================================
void CEnemyCaveat::Draw(CShader* pShader)
{
	// 敵の描画
	CEnemy::Draw(pShader);
}

//============================================================
// 状態処理
//============================================================
void CEnemyCaveat::State(void)
{
	switch (m_state)
	{
	case CEnemyCaveat::STATE_CRAWL:



		break;

	case CEnemyCaveat::STATE_CAVEAT:



		break;

	default:		// 例外処理
		assert(false);
		break;
	}
}
