////============================================================
////
////	追跡敵ヘッダー [enemy_chase.h]
////	Author：小原立暉
////
////============================================================
////************************************************************
////	二重インクルード防止
////************************************************************
//#ifndef _ENEMY_CHASE_H_
//#define _ENEMY_CHASE_H_
//
////************************************************************
////	インクルードファイル
////************************************************************
//#include "enemy.h"
//
////************************************************************
////	クラス定義
////************************************************************
//// 追跡敵クラス
//class CEnemyChase : public CEnemy
//{
//public:
//	// コンストラクタ
//	explicit CEnemyChase(const EType type);
//
//	// デストラクタ
//	~CEnemyChase() override;
//
//	// オーバーライド関数
//	HRESULT Init(void) override;	// 初期化
//	void Uninit(void) override;		// 終了
//	void Update(const float fDeltaTime) override;	// 更新
//	void Draw(CShader* pShader = nullptr) override;	// 描画
//
//private:
//
//};
//
//#endif	// _ENEMY_SMALL_H_
