//================================================================================================================
//
// 敵の攻撃状態処理 [enemyStateAttack.cpp]
// Author：小原立暉
//
//================================================================================================================
//****************************************************************************************************************
//	インクルードファイル
//****************************************************************************************************************
#include "enemyStateAttack.h"
#include "enemy.h"
#include "useful.h"

#include "enemyStateNone.h"

//==========================
// コンストラクタ
//==========================
CEnemyStateAttack::CEnemyStateAttack(CEnemy* pEnemy) : CEnemyState(pEnemy)
{

}

//==========================
// デストラクタ
//==========================
CEnemyStateAttack::~CEnemyStateAttack()
{

}

//==========================
// 状態処理
//==========================
void CEnemyStateAttack::Process(void)
{
	// ここでアタックモーションにすればGood!!

	// 攻撃モーションが終わったらNoneStateにする
	GetEnemy()->ChangeState(new CEnemyStateNone(GetEnemy()));
}