//============================================================
//
//	フェードイン状態ヘッダー [fadeStateIn.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _FADE_STATE_IN_H_
#define _FADE_STATE_IN_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "fadeState.h"

//************************************************************
//	クラス定義
//************************************************************
// フェードイン状態クラス
class CFadeStateIn : public CFadeState
{
public:
	// コンストラクタ
	CFadeStateIn();

	// デストラクタ
	~CFadeStateIn() override;

	// オーバーライド関数
	HRESULT Init(void) override;	// 初期化
	void Uninit(void) override;		// 終了
	void Update(const float fDeltaTime) override;	// 更新

private:
	// メンバ変数
	float m_fCurTime;	// 現在の経過時間
};

#endif	// _FADE_STATE_IN_H_
