//============================================================
//
//	何もしない状態ヘッダー [fadeStateNone.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _FADE_STATE_NONE_H_
#define _FADE_STATE_NONE_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "fadeState.h"

//************************************************************
//	クラス定義
//************************************************************
// 何もしない状態クラス
class CFadeStateNone : public CFadeState
{
public:
	// コンストラクタ
	CFadeStateNone();

	// デストラクタ
	~CFadeStateNone() override;

	// オーバーライド関数
	HRESULT Init(void) override;	// 初期化
	void Uninit(void) override;		// 終了
	void Update(const float fDeltaTime) override;	// 更新
};

#endif	// _FADE_STATE_NONE_H_
