//============================================================
//
//	フェードアウト状態ヘッダー [fadeStateOut.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _FADE_STATE_OUT_H_
#define _FADE_STATE_OUT_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "fadeState.h"
#include "scene.h"

//************************************************************
//	クラス定義
//************************************************************
// フェードアウト状態クラス
class CFadeStateOut : public CFadeState
{
public:
	// コンストラクタ
	CFadeStateOut();

	// デストラクタ
	~CFadeStateOut() override;

	// オーバーライド関数
	HRESULT Init(void) override;	// 初期化
	void Uninit(void) override;		// 終了
	void Update(const float fDeltaTime) override;	// 更新
};

#endif	// _FADE_STATE_OUT_H_
