//============================================================
//
//	フェードイン状態処理 [fadeStateIn.cpp]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	インクルードファイル
//************************************************************
#include "fadeStateIn.h"
#include "fade.h"
#include "manager.h"
#include "loading.h"

//************************************************************
//	子クラス [CFadeStateIn] のメンバ関数
//************************************************************
//============================================================
//	コンストラクタ
//============================================================
CFadeStateIn::CFadeStateIn()
{

}

//============================================================
//	デストラクタ
//============================================================
CFadeStateIn::~CFadeStateIn()
{

}

//============================================================
//	初期化処理
//============================================================
HRESULT CFadeStateIn::Init(void)
{
	// 成功を返す
	return S_OK;
}

//============================================================
//	終了処理
//============================================================
void CFadeStateIn::Uninit(void)
{
	// 自身の破棄
	delete this;
}

//============================================================
//	更新処理
//============================================================
void CFadeStateIn::Update(const float fDeltaTime)
{
	// ロードが完了していない場合抜ける
	if (GET_MANAGER->GetLoading()->GetState() != CLoading::LOAD_NONE) { return; }

	// 透明にしていく
	if (m_pContext->SubAlpha(fDeltaTime))
	{ // 透明になった場合

		// 何もしない状態にする
		m_pContext->ChangeState(new CFadeStateNone);
	}
}
