//============================================================
//
//	ジャンプ台処理 [gimmick_jumptable.cpp]
//	Author：小原立暉
//
//============================================================
//************************************************************
//	インクルードファイル
//************************************************************
#include "manager.h"
#include "gimmick_jumptable.h"

//************************************************************
//	子クラス [CGimmickJumpTable] のメンバ関数
//************************************************************
//============================================================
//	コンストラクタ
//============================================================
CGimmickJumpTable::CGimmickJumpTable() : CGimmickAction()
{

}

//============================================================
//	デストラクタ
//============================================================
CGimmickJumpTable::~CGimmickJumpTable()
{

}

//============================================================
//	初期化処理
//============================================================
HRESULT CGimmickJumpTable::Init(void)
{
	// オブジェクト3Dの初期化
	if (FAILED(CGimmickAction::Init()))
	{ // 初期化に失敗した場合

		// 失敗を返す
		assert(false);
		return E_FAIL;
	}

	// 成功を返す
	return S_OK;
}

//============================================================
//	終了処理
//============================================================
void CGimmickJumpTable::Uninit(void)
{
	// オブジェクト3Dの終了
	CGimmickAction::Uninit();
}

//============================================================
//	更新処理
//============================================================
void CGimmickJumpTable::Update(const float fDeltaTime)
{
	// オブジェクト3Dの更新
	CGimmickAction::Update(fDeltaTime);
}

//============================================================
//	描画処理
//============================================================
void CGimmickJumpTable::Draw(CShader* pShader)
{
	// オブジェクト3Dの描画
	CGimmickAction::Draw(pShader);
}