//============================================================
//
//	レンダーテクスチャ処理 [renderTexture.cpp]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	インクルードファイル
//************************************************************
#include "renderTexture.h"

//************************************************************
//	子クラス [CRenderTexture] のメンバ関数
//************************************************************
//============================================================
//	コンストラクタ
//============================================================
CRenderTexture::CRenderTexture()
{

}

//============================================================
//	デストラクタ
//============================================================
CRenderTexture::~CRenderTexture()
{

}

//============================================================
//	初期化処理
//============================================================
HRESULT CRenderTexture::Init(void)
{
	// 成功を返す
	return S_OK;
}

//============================================================
//	終了処理
//============================================================
void CRenderTexture::Uninit(void)
{

}

//============================================================
//	更新処理
//============================================================
void CRenderTexture::Update(const float fDeltaTime)
{

}

//============================================================
//	描画処理
//============================================================
void CRenderTexture::Draw(CShader *pShader)
{

}

//============================================================
//	生成処理
//============================================================
CRenderTexture *CRenderTexture::Create(void)
{
	// レンダーテクスチャの生成
	CRenderTexture *pRenderTexture = new CRenderTexture;
	if (pRenderTexture == nullptr)
	{ // 生成に失敗した場合

		return nullptr;
	}
	else
	{ // 生成に成功した場合

		// レンダーテクスチャの初期化
		if (FAILED(pRenderTexture->Init()))
		{ // 初期化に失敗した場合

			// レンダーテクスチャの破棄
			SAFE_DELETE(pRenderTexture);
			return nullptr;
		}

		// 確保したアドレスを返す
		return pRenderTexture;
	}
}
