//============================================================
//
//	ロゴ画面ヘッダー [sceneGame.h]
//	Author：小原立暉
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _SCENE_LOGO_H_
#define _SCENE_LOGO_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "scene.h"

//************************************************************
//	前方宣言
//************************************************************
class CLogoManager;	// ロゴマネージャークラス

//************************************************************
//	クラス定義
//************************************************************
// ロゴ画面クラス
class CSceneLogo : public CScene
{
public:
	// コンストラクタ
	explicit CSceneLogo(const EMode mode);

	// デストラクタ
	~CSceneLogo() override;

	// オーバーライド関数
	HRESULT Init(void) override;	// 初期化
	void Uninit(void) override;		// 終了
	void Update(const float fDeltaTime) override;	// 更新

	// 静的メンバ関数
	static CLogoManager* GetLogoManager(void);	// ロゴマネージャー取得

private:

	// 静的メンバ変数
	static CLogoManager* m_pLogoManager;		// ロゴマネージャー
};

#endif	// _SCENE_LOGO_H_
