//============================================================
//
//	タイトル遷移ポイント処理 [transpoint_title.cpp]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	インクルードファイル
//************************************************************
#include "transpoint_title.h"
#include "balloonManager.h"
#include "balloon.h"

//************************************************************
//	定数宣言
//************************************************************
namespace
{

}

//************************************************************
//	子クラス [CTransPointTitle] のメンバ関数
//************************************************************
//============================================================
//	コンストラクタ
//============================================================
CTransPointTitle::CTransPointTitle() : CTransPoint("data\\MAP\\TITLE00\\map.txt")
{

}

//============================================================
//	デストラクタ
//============================================================
CTransPointTitle::~CTransPointTitle()
{

}

//============================================================
//	初期化処理
//============================================================
HRESULT CTransPointTitle::Init(void)
{
	// 遷移ポイントの初期化
	if (FAILED(CTransPoint::Init()))
	{ // 初期化に失敗した場合

		// 失敗を返す
		assert(false);
		return E_FAIL;
	}

	// 吹き出しマネージャー取得
	CBalloonManager* pManager = GetBalloonManager();
	if (pManager != nullptr)
	{ // マネージャーが生成されている場合

		// 神器アイコンの表示をOFFにする
		pManager->SetDrawAllGodItem(false);
	}

	// 成功を返す
	return S_OK;
}

//============================================================
//	更新処理
//============================================================
void CTransPointTitle::Update(const float fDeltaTime)
{
	// 遷移ポイントの更新
	CTransPoint::Update(fDeltaTime);

	// 表示吹き出しが自分の遷移ポイントじゃない場合抜ける
	if (!IsSameBalloon()) { return; }

	// 吹き出しマネージャー取得
	CBalloonManager* pManager = GetBalloonManager();
	if (pManager != nullptr)
	{ // マネージャーが生成されている場合

		// 神器アイコンの表示をOFFにする
		pManager->SetDrawAllGodItem(false);
	}
}
