//============================================================
//
//	タイトル遷移ポイントヘッダー [transpoint_title.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _TRANSPOINT_TITLE_H_
#define _TRANSPOINT_TITLE_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "transpoint.h"

//************************************************************
//	クラス定義
//************************************************************
// タイトル遷移ポイントクラス
class CTransPointTitle : public CTransPoint
{
public:
	// コンストラクタ
	explicit CTransPointTitle();

	// デストラクタ
	~CTransPointTitle() override;

	// オーバーライド関数
	HRESULT Init(void) override;	// 初期化
	void Update(const float fDeltaTime) override;	// 更新
};

#endif	// _TRANSPOINT_TITLE_H_
